int convertIdWeather(int i) {
  late int id = 0;
  //Nhóm 2xx: Giông bão
  if (i == 200 ||
      i == 201 ||
      i == 202 ||
      i == 210 ||
      i == 211 ||
      i == 212 ||
      i == 221 ||
      i == 230 ||
      i == 231 ||
      i == 232) {
    id = 200;
  }
  // dông
  if (i == 211) {
    id = 211;
  }
  //Nhóm 3xx: Mưa phùn
  if (i == 300 ||
      i == 301 ||
      i == 302 ||
      i == 310 ||
      i == 311 ||
      i == 312 ||
      i == 313 ||
      i == 314 ||
      i == 321) {
    id = 300;
  }
  //Nhóm 5xx: Mưa dông
  if (i == 500 ||
      i == 501 ||
      i == 502 ||
      i == 503 ||
      i == 504 ||
      i == 520 ||
      i == 521 ||
      i == 522 ||
      i == 531) {
    id = 500;
  }
  // mưa tuyết
  if (i == 511) {
    id = 511;
  }
  //Nhóm 6xx: Tuyết
  if (i == 600 ||
      i == 601 ||
      i == 602 ||
      i == 611 ||
      i == 612 ||
      i == 613 ||
      i == 615 ||
      i == 616 ||
      i == 620 ||
      i == 621 ||
      i == 622) {
    id = 600;
  }
  //Nhóm 7xx: Bầu không khí
  if (i == 701 ||
      i == 711 ||
      i == 721 ||
      i == 731 ||
      i == 741 ||
      i == 751 ||
      i == 761 ||
      i == 762 ||
      i == 771 ||
      i == 781) {
    id = 700;
  }
  //Nhóm 800: Rõ ràng
  if (i == 800) {
    id = 800;
  }
  //Nhóm 80x: Mây
  if (i == 801 || i == 802) {
    id = 801;
  }
  // cực kỳ nhiều mây
  if (i == 803 || i == 804) {
    id = 803;
  }
  return id;
}